# Taps
tap 'homebrew/bundle'
tap 'mongodb/brew'

# Packages
brew 'ddev/ddev/ddev'
brew 'mkcert'
brew 'nss'
brew 'nvm'
brew 'neovim'
brew 'lazygit'
brew 'ripgrep'
brew 'openssl'
brew 'starship'
brew 'eza'
brew 'prettierd'
brew 'mongodb-community@7.0'
brew 'php'
brew 'composer'

##
# Apps
#

# Browser
cask 'firefox'
cask 'firefox@developer-edition'

# Code editors
cask 'visual-studio-code'
cask 'cursor'
cask 'zed'

# Terminal emulators
cask 'iterm2'
cask 'alacritty'

# Other
cask 'orbstack'
cask 'figma'
cask 'amethyst'
cask 'jumpcut'
cask 'spotify'
cask 'pearcleaner'
cask 'keepassxc'
