# Taps
tap 'homebrew/bundle'
tap 'mongodb/brew'

# Development
brew 'ddev/ddev/ddev'
brew 'mkcert'
brew 'nss'
brew 'nvm'
brew 'neovim'
brew 'lazygit'
brew 'ripgrep'
brew 'starship'
brew 'tmux'
brew 'eza'
brew 'prettierd'
brew 'mongodb-community@7.0'

# Nice to have
brew 'spotify_player'

# Apps
cask 'alt-tab'
cask 'amethyst'
cask 'hiddenbar'
cask 'jumpcut'
